docs/media/reviews/books/the_mountain_in_the_sea.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-06-22 Sun 19:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Mountain in the Sea</title>
<meta name="author" content="Noelle Crawford" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">The Mountain in the Sea
<br />
<span class="subtitle">“The great and terrible thing about humankind is simply this: we will always do what we are capable of.” &#x2013; Ray Nayler, The Mountain in the Sea</span>
</h1>
<p>
This book is definitely not what I expected based on the jacket summary, but I cannot say I was dissapointed. While the story claims to be about a colony of octopi that have managed to develop a culture and language of their own, the story ends with us gaining very little understanding of what that entails.
In fact, we as readers never learn more about the octopi than the scientists studying them are able to observe. I actually really liked this about the story, as I think it mirrors real scientific research quite well: progress is slow and major results are unlikely within a single person's career/lifetime, but that does not make study worthless.
</p>

<p>
More interesting than the octopi is the world in which they are being studied. The setting is a version of earth (far?) in the future where AI has become indistinguishable (in some cases) from human life. We are shown various AI entities (an AI run slave ship, animatronic AI monks, AI significant others) which have varying levels of sentience based on the tasks they're given. It felt as if the author was asking us to try and draw the line as to which we'd consider sentient (if any) and which we wouldn't, which is actually quite difficult.
I will admit I was a bit dissapointed with how many answers the author tried to "give" us directly to questions that were, in my opinion, much too philisophical in nature to have correct answers. Luckily this was a pretty minor inclusion and didn't affect my overall enjoyment of the book.
</p>

<p>
Especially now as AI gets more advanced and becomes an essential part of life, this book hits close to home. Definitely one I'd recommend.
</p>
</div>
<div id="postamble" class="status">
<p class="author">Author: Noelle Crawford</p>
<p class="date">Created: 2025-06-22 Sun 19:33</p>
</div>
</body>
</html>
